WorkforceHRApps-service-tests/src/main/resources/e2e/soapPayload1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bsvc="urn:com.workday/bsvc">
  <soapenv:Header>
  <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" soapenv:mustUnderstand="1">
                                          <wsse:UsernameToken wsu:Id="UsernameToken-8E4CE59C40223F9A41140909783822714">
                                                        <wsse:Username>intuitintegrationadmin@intuit2</wsse:Username>
                                                         <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">Intuit@2</wsse:Password>
                                                         <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">SE9hU4Yhe9LEDl0niri1yQ==</wsse:Nonce>
                                                         <wsu:Created>2014-08-27T00:03:58.227Z</wsu:Created>
                                          </wsse:UsernameToken>
   </wsse:Security>
     <bsvc:Workday_Common_Header>
        <!--Optional:-->
        <bsvc:Include_Reference_Descriptors_In_Response>true</bsvc:Include_Reference_Descriptors_In_Response>
     </bsvc:Workday_Common_Header>
  </soapenv:Header>
  <soapenv:Body>
     <bsvc:Get_Event_Documents_Request bsvc:version="v27.2">
        <bsvc:Request_References>
           <!--1 or more repetitions:-->
           <bsvc:Integration_Event_Reference bsvc:Descriptor="?">
              <!--Zero or more repetitions:-->
              <bsvc:ID bsvc:type="WID">0525beda7a29100bcf5e47198ee5107f</bsvc:ID>
           </bsvc:Integration_Event_Reference>
        </bsvc:Request_References>
       
     </bsvc:Get_Event_Documents_Request>
  </soapenv:Body>
</soapenv:Envelope>
